#+TITLE: I can haz differentiable programs?

* Setup

Just run this code block to get started.

#+BEGIN_SRC emacs-lisp
(require 'org-drill)
(org-drill)
#+END_SRC

#+RESULTS:
: You can continue the drill session with the command ‘org-drill-resume’.

You will get asked a series of questions which you can answer in your head. After you think you have it, press a key to see the answer. You will be asked to grade your answer using the following numeric scale. org-drill will save your answer and use it to define future questions for you to review.

| Quality | Fail? | Meaning                                              |
|---------+-------+------------------------------------------------------|
|       0 | Yes   | Wrong, and the answer is unfamiliar when you see it. |
|       1 | Yes   | Wrong answer.                                        |
|       2 | Yes   | Almost, but not quite correct.                       |
|       3 | No    | Correct answer, but with much effort.                |
|       4 | No    | Correct answer, with a little thought.               |
|       5 | No    | Correct answer, effortless.                          |

You can reset this document and clear all training data with this block.

#+BEGIN_SRC emacs-lisp
(org-drill-strip-all-data)
#+END_SRC

#+RESULTS:
: Done.

